At f8e1d1e999aa08ef343d212e2be9447ff5366c71 there are some regressions:

```console
% ACCTEST_TIMEOUT=720m make testacc TESTARGS='-run=TestAccDynamoDBTable_\|TestAccDynamoDBTableDataSource_' PKG=dynamodb ACCTEST_PARALLELISM=4
make: Verifying source code with gofmt...
==> Checking that code complies with gofmt requirements...
TF_ACC=1 go1.24.6 test ./internal/service/dynamodb/... -v -count 1 -parallel 4  -run=TestAccDynamoDBTable_\|TestAccDynamoDBTableDataSource_ -timeout 720m -vet=off
2025/09/05 09:52:52 Creating Terraform AWS Provider (SDKv2-style)...
2025/09/05 09:52:52 Initializing Terraform AWS Provider (SDKv2-style)...
=== RUN   TestAccDynamoDBTableDataSource_tags
=== PAUSE TestAccDynamoDBTableDataSource_tags
=== RUN   TestAccDynamoDBTableDataSource_tags_NullMap
=== PAUSE TestAccDynamoDBTableDataSource_tags_NullMap
=== RUN   TestAccDynamoDBTableDataSource_tags_EmptyMap
=== PAUSE TestAccDynamoDBTableDataSource_tags_EmptyMap
=== RUN   TestAccDynamoDBTableDataSource_tags_DefaultTags_nonOverlapping
=== PAUSE TestAccDynamoDBTableDataSource_tags_DefaultTags_nonOverlapping
=== RUN   TestAccDynamoDBTableDataSource_tags_IgnoreTags_Overlap_DefaultTag
=== PAUSE TestAccDynamoDBTableDataSource_tags_IgnoreTags_Overlap_DefaultTag
=== RUN   TestAccDynamoDBTableDataSource_tags_IgnoreTags_Overlap_ResourceTag
=== PAUSE TestAccDynamoDBTableDataSource_tags_IgnoreTags_Overlap_ResourceTag
=== RUN   TestAccDynamoDBTableDataSource_basic
=== PAUSE TestAccDynamoDBTableDataSource_basic
=== RUN   TestAccDynamoDBTableDataSource_onDemandThroughput
=== PAUSE TestAccDynamoDBTableDataSource_onDemandThroughput
=== RUN   TestAccDynamoDBTableDataSource_pointInTimeRecovery
=== PAUSE TestAccDynamoDBTableDataSource_pointInTimeRecovery
=== RUN   TestAccDynamoDBTable_tags
=== PAUSE TestAccDynamoDBTable_tags
=== RUN   TestAccDynamoDBTable_tags_null
=== PAUSE TestAccDynamoDBTable_tags_null
=== RUN   TestAccDynamoDBTable_tags_EmptyMap
=== PAUSE TestAccDynamoDBTable_tags_EmptyMap
=== RUN   TestAccDynamoDBTable_tags_AddOnUpdate
=== PAUSE TestAccDynamoDBTable_tags_AddOnUpdate
=== RUN   TestAccDynamoDBTable_tags_EmptyTag_OnCreate
=== PAUSE TestAccDynamoDBTable_tags_EmptyTag_OnCreate
=== RUN   TestAccDynamoDBTable_tags_EmptyTag_OnUpdate_Add
=== PAUSE TestAccDynamoDBTable_tags_EmptyTag_OnUpdate_Add
=== RUN   TestAccDynamoDBTable_tags_EmptyTag_OnUpdate_Replace
=== PAUSE TestAccDynamoDBTable_tags_EmptyTag_OnUpdate_Replace
=== RUN   TestAccDynamoDBTable_tags_DefaultTags_providerOnly
=== PAUSE TestAccDynamoDBTable_tags_DefaultTags_providerOnly
=== RUN   TestAccDynamoDBTable_tags_DefaultTags_nonOverlapping
=== PAUSE TestAccDynamoDBTable_tags_DefaultTags_nonOverlapping
=== RUN   TestAccDynamoDBTable_tags_DefaultTags_overlapping
=== PAUSE TestAccDynamoDBTable_tags_DefaultTags_overlapping
=== RUN   TestAccDynamoDBTable_tags_DefaultTags_updateToProviderOnly
=== PAUSE TestAccDynamoDBTable_tags_DefaultTags_updateToProviderOnly
=== RUN   TestAccDynamoDBTable_tags_DefaultTags_updateToResourceOnly
=== PAUSE TestAccDynamoDBTable_tags_DefaultTags_updateToResourceOnly
=== RUN   TestAccDynamoDBTable_tags_DefaultTags_emptyResourceTag
=== PAUSE TestAccDynamoDBTable_tags_DefaultTags_emptyResourceTag
=== RUN   TestAccDynamoDBTable_tags_DefaultTags_emptyProviderOnlyTag
=== PAUSE TestAccDynamoDBTable_tags_DefaultTags_emptyProviderOnlyTag
=== RUN   TestAccDynamoDBTable_tags_DefaultTags_nullOverlappingResourceTag
=== PAUSE TestAccDynamoDBTable_tags_DefaultTags_nullOverlappingResourceTag
=== RUN   TestAccDynamoDBTable_tags_DefaultTags_nullNonOverlappingResourceTag
=== PAUSE TestAccDynamoDBTable_tags_DefaultTags_nullNonOverlappingResourceTag
=== RUN   TestAccDynamoDBTable_tags_ComputedTag_OnCreate
=== PAUSE TestAccDynamoDBTable_tags_ComputedTag_OnCreate
=== RUN   TestAccDynamoDBTable_tags_ComputedTag_OnUpdate_Add
=== PAUSE TestAccDynamoDBTable_tags_ComputedTag_OnUpdate_Add
=== RUN   TestAccDynamoDBTable_tags_ComputedTag_OnUpdate_Replace
=== PAUSE TestAccDynamoDBTable_tags_ComputedTag_OnUpdate_Replace
=== RUN   TestAccDynamoDBTable_tags_IgnoreTags_Overlap_DefaultTag
=== PAUSE TestAccDynamoDBTable_tags_IgnoreTags_Overlap_DefaultTag
=== RUN   TestAccDynamoDBTable_tags_IgnoreTags_Overlap_ResourceTag
=== PAUSE TestAccDynamoDBTable_tags_IgnoreTags_Overlap_ResourceTag
=== RUN   TestAccDynamoDBTable_basic
=== PAUSE TestAccDynamoDBTable_basic
=== RUN   TestAccDynamoDBTable_deletion_protection
=== PAUSE TestAccDynamoDBTable_deletion_protection
=== RUN   TestAccDynamoDBTable_disappears
=== PAUSE TestAccDynamoDBTable_disappears
=== RUN   TestAccDynamoDBTable_Disappears_payPerRequestWithGSI
=== PAUSE TestAccDynamoDBTable_Disappears_payPerRequestWithGSI
=== RUN   TestAccDynamoDBTable_extended
=== PAUSE TestAccDynamoDBTable_extended
=== RUN   TestAccDynamoDBTable_enablePITR
=== PAUSE TestAccDynamoDBTable_enablePITR
=== RUN   TestAccDynamoDBTable_enablePITRWithCustomRecoveryPeriod
=== PAUSE TestAccDynamoDBTable_enablePITRWithCustomRecoveryPeriod
=== RUN   TestAccDynamoDBTable_BillingMode_payPerRequestToProvisioned
=== PAUSE TestAccDynamoDBTable_BillingMode_payPerRequestToProvisioned
=== RUN   TestAccDynamoDBTable_BillingMode_payPerRequestToProvisionedIgnoreChanges
=== PAUSE TestAccDynamoDBTable_BillingMode_payPerRequestToProvisionedIgnoreChanges
=== RUN   TestAccDynamoDBTable_BillingMode_provisionedToPayPerRequest
=== PAUSE TestAccDynamoDBTable_BillingMode_provisionedToPayPerRequest
=== RUN   TestAccDynamoDBTable_BillingMode_provisionedToPayPerRequestIgnoreChanges
=== PAUSE TestAccDynamoDBTable_BillingMode_provisionedToPayPerRequestIgnoreChanges
=== RUN   TestAccDynamoDBTable_BillingModeGSI_payPerRequestToProvisioned
=== PAUSE TestAccDynamoDBTable_BillingModeGSI_payPerRequestToProvisioned
=== RUN   TestAccDynamoDBTable_BillingModeGSI_provisionedToPayPerRequest
=== PAUSE TestAccDynamoDBTable_BillingModeGSI_provisionedToPayPerRequest
=== RUN   TestAccDynamoDBTable_BillingMode_payPerRequestBasic
=== PAUSE TestAccDynamoDBTable_BillingMode_payPerRequestBasic
=== RUN   TestAccDynamoDBTable_onDemandThroughput
=== PAUSE TestAccDynamoDBTable_onDemandThroughput
=== RUN   TestAccDynamoDBTable_gsiOnDemandThroughput
=== PAUSE TestAccDynamoDBTable_gsiOnDemandThroughput
=== RUN   TestAccDynamoDBTable_streamSpecification
=== PAUSE TestAccDynamoDBTable_streamSpecification
=== RUN   TestAccDynamoDBTable_streamSpecificationDiffs
=== PAUSE TestAccDynamoDBTable_streamSpecificationDiffs
=== RUN   TestAccDynamoDBTable_streamSpecificationValidation
=== PAUSE TestAccDynamoDBTable_streamSpecificationValidation
=== RUN   TestAccDynamoDBTable_gsiUpdateCapacity
=== PAUSE TestAccDynamoDBTable_gsiUpdateCapacity
=== RUN   TestAccDynamoDBTable_gsiUpdateOtherAttributes
=== PAUSE TestAccDynamoDBTable_gsiUpdateOtherAttributes
=== RUN   TestAccDynamoDBTable_lsiNonKeyAttributes
=== PAUSE TestAccDynamoDBTable_lsiNonKeyAttributes
=== RUN   TestAccDynamoDBTable_gsiUpdateNonKeyAttributes
=== PAUSE TestAccDynamoDBTable_gsiUpdateNonKeyAttributes
=== RUN   TestAccDynamoDBTable_GsiUpdateNonKeyAttributes_emptyPlan
=== PAUSE TestAccDynamoDBTable_GsiUpdateNonKeyAttributes_emptyPlan
=== RUN   TestAccDynamoDBTable_TTL_enabled
=== PAUSE TestAccDynamoDBTable_TTL_enabled
=== RUN   TestAccDynamoDBTable_TTL_disabled
=== PAUSE TestAccDynamoDBTable_TTL_disabled
=== RUN   TestAccDynamoDBTable_TTL_updateEnable
=== PAUSE TestAccDynamoDBTable_TTL_updateEnable
=== RUN   TestAccDynamoDBTable_TTL_updateDisable
=== PAUSE TestAccDynamoDBTable_TTL_updateDisable
=== RUN   TestAccDynamoDBTable_TTL_validate
=== PAUSE TestAccDynamoDBTable_TTL_validate
=== RUN   TestAccDynamoDBTable_attributeUpdate
=== PAUSE TestAccDynamoDBTable_attributeUpdate
=== RUN   TestAccDynamoDBTable_lsiUpdate
=== PAUSE TestAccDynamoDBTable_lsiUpdate
=== RUN   TestAccDynamoDBTable_attributeUpdateValidation
=== PAUSE TestAccDynamoDBTable_attributeUpdateValidation
=== RUN   TestAccDynamoDBTable_encryption
=== PAUSE TestAccDynamoDBTable_encryption
=== RUN   TestAccDynamoDBTable_restoreCrossRegion
=== PAUSE TestAccDynamoDBTable_restoreCrossRegion
=== RUN   TestAccDynamoDBTable_Replica_multiple
=== PAUSE TestAccDynamoDBTable_Replica_multiple
=== RUN   TestAccDynamoDBTable_Replica_single
=== PAUSE TestAccDynamoDBTable_Replica_single
=== RUN   TestAccDynamoDBTable_Replica_singleStreamSpecification
=== PAUSE TestAccDynamoDBTable_Replica_singleStreamSpecification
=== RUN   TestAccDynamoDBTable_Replica_singleDefaultKeyEncrypted
=== PAUSE TestAccDynamoDBTable_Replica_singleDefaultKeyEncrypted
=== RUN   TestAccDynamoDBTable_Replica_singleDefaultKeyEncryptedAmazonOwned
=== PAUSE TestAccDynamoDBTable_Replica_singleDefaultKeyEncryptedAmazonOwned
=== RUN   TestAccDynamoDBTable_Replica_singleCMK
=== PAUSE TestAccDynamoDBTable_Replica_singleCMK
=== RUN   TestAccDynamoDBTable_Replica_doubleAddCMK
=== PAUSE TestAccDynamoDBTable_Replica_doubleAddCMK
=== RUN   TestAccDynamoDBTable_Replica_pitr
=== PAUSE TestAccDynamoDBTable_Replica_pitr
=== RUN   TestAccDynamoDBTable_Replica_pitrKMS
=== PAUSE TestAccDynamoDBTable_Replica_pitrKMS
=== RUN   TestAccDynamoDBTable_Replica_tags_updateIsPropagated_oneOfTwo
=== PAUSE TestAccDynamoDBTable_Replica_tags_updateIsPropagated_oneOfTwo
=== RUN   TestAccDynamoDBTable_Replica_tags_updateIsPropagated_twoOfTwo
=== PAUSE TestAccDynamoDBTable_Replica_tags_updateIsPropagated_twoOfTwo
=== RUN   TestAccDynamoDBTable_Replica_tags_propagateToAddedReplica
=== PAUSE TestAccDynamoDBTable_Replica_tags_propagateToAddedReplica
=== RUN   TestAccDynamoDBTable_Replica_tags_notPropagatedToAddedReplica
=== PAUSE TestAccDynamoDBTable_Replica_tags_notPropagatedToAddedReplica
=== RUN   TestAccDynamoDBTable_Replica_tags_nonPropagatedTagsAreUnmanaged
=== PAUSE TestAccDynamoDBTable_Replica_tags_nonPropagatedTagsAreUnmanaged
=== RUN   TestAccDynamoDBTable_Replica_tagsUpdate
=== PAUSE TestAccDynamoDBTable_Replica_tagsUpdate
=== RUN   TestAccDynamoDBTable_Replica_MRSC_Create
--- PASS: TestAccDynamoDBTable_Replica_MRSC_Create (182.56s)
=== RUN   TestAccDynamoDBTable_Replica_MRSC_doubleAddCMK
=== PAUSE TestAccDynamoDBTable_Replica_MRSC_doubleAddCMK
=== RUN   TestAccDynamoDBTable_Replica_MRSC_pitr
--- PASS: TestAccDynamoDBTable_Replica_MRSC_pitr (207.35s)
=== RUN   TestAccDynamoDBTable_Replica_MRSC_pitrKMS
=== PAUSE TestAccDynamoDBTable_Replica_MRSC_pitrKMS
=== RUN   TestAccDynamoDBTable_Replica_MRSC_tags_updateIsPropagated_oneOfTwo
--- PASS: TestAccDynamoDBTable_Replica_MRSC_tags_updateIsPropagated_oneOfTwo (245.28s)
=== RUN   TestAccDynamoDBTable_Replica_MRSC_tags_updateIsPropagated_twoOfTwo
--- PASS: TestAccDynamoDBTable_Replica_MRSC_tags_updateIsPropagated_twoOfTwo (249.12s)
=== RUN   TestAccDynamoDBTable_Replica_MRSC_tags_propagateToAddedReplica
--- PASS: TestAccDynamoDBTable_Replica_MRSC_tags_propagateToAddedReplica (449.90s)
=== RUN   TestAccDynamoDBTable_Replica_MRSC_tags_notPropagatedToAddedReplica
--- PASS: TestAccDynamoDBTable_Replica_MRSC_tags_notPropagatedToAddedReplica (484.44s)
=== RUN   TestAccDynamoDBTable_Replica_MRSC_tags_nonPropagatedTagsAreUnmanaged
--- PASS: TestAccDynamoDBTable_Replica_MRSC_tags_nonPropagatedTagsAreUnmanaged (224.10s)
=== RUN   TestAccDynamoDBTable_Replica_MRSC_tagsUpdate
--- PASS: TestAccDynamoDBTable_Replica_MRSC_tagsUpdate (314.58s)
=== RUN   TestAccDynamoDBTable_Replica_MRSC_TooManyReplicas
=== PAUSE TestAccDynamoDBTable_Replica_MRSC_TooManyReplicas
=== RUN   TestAccDynamoDBTable_Replica_MRSC_NotEnoughReplicas
=== PAUSE TestAccDynamoDBTable_Replica_MRSC_NotEnoughReplicas
=== RUN   TestAccDynamoDBTable_Replica_MRSC_MixedConsistencyModes
=== PAUSE TestAccDynamoDBTable_Replica_MRSC_MixedConsistencyModes
=== RUN   TestAccDynamoDBTable_Replica_MRSC_CreateEventuallyConsistent
=== PAUSE TestAccDynamoDBTable_Replica_MRSC_CreateEventuallyConsistent
=== RUN   TestAccDynamoDBTable_Replica_upgradeV6_2_0
=== PAUSE TestAccDynamoDBTable_Replica_upgradeV6_2_0
=== RUN   TestAccDynamoDBTable_Replica_deletionProtection
=== PAUSE TestAccDynamoDBTable_Replica_deletionProtection
=== RUN   TestAccDynamoDBTable_tableClassInfrequentAccess
=== PAUSE TestAccDynamoDBTable_tableClassInfrequentAccess
=== RUN   TestAccDynamoDBTable_tableClassExplicitDefault
=== PAUSE TestAccDynamoDBTable_tableClassExplicitDefault
=== RUN   TestAccDynamoDBTable_tableClass_ConcurrentModification
=== PAUSE TestAccDynamoDBTable_tableClass_ConcurrentModification
=== RUN   TestAccDynamoDBTable_tableClass_migrate
=== PAUSE TestAccDynamoDBTable_tableClass_migrate
=== RUN   TestAccDynamoDBTable_backupEncryption
=== PAUSE TestAccDynamoDBTable_backupEncryption
=== RUN   TestAccDynamoDBTable_backup_overrideEncryption
=== PAUSE TestAccDynamoDBTable_backup_overrideEncryption
=== RUN   TestAccDynamoDBTable_importTable
=== PAUSE TestAccDynamoDBTable_importTable
=== RUN   TestAccDynamoDBTable_warmThroughput
=== PAUSE TestAccDynamoDBTable_warmThroughput
=== RUN   TestAccDynamoDBTable_gsiWarmThroughput_billingProvisioned
=== PAUSE TestAccDynamoDBTable_gsiWarmThroughput_billingProvisioned
=== RUN   TestAccDynamoDBTable_gsiWarmThroughput_billingPayPerRequest
=== PAUSE TestAccDynamoDBTable_gsiWarmThroughput_billingPayPerRequest
=== RUN   TestAccDynamoDBTable_gsiWarmThroughput_switchBilling
=== PAUSE TestAccDynamoDBTable_gsiWarmThroughput_switchBilling
=== CONT  TestAccDynamoDBTable_Replica_MRSC_doubleAddCMK
=== CONT  TestAccDynamoDBTable_tableClass_ConcurrentModification
=== CONT  TestAccDynamoDBTable_Replica_tagsUpdate
=== CONT  TestAccDynamoDBTableDataSource_tags
--- PASS: TestAccDynamoDBTableDataSource_tags (20.82s)
=== CONT  TestAccDynamoDBTable_warmThroughput
--- PASS: TestAccDynamoDBTable_tableClass_ConcurrentModification (41.90s)
=== CONT  TestAccDynamoDBTable_gsiWarmThroughput_switchBilling
--- PASS: TestAccDynamoDBTable_warmThroughput (77.67s)
=== CONT  TestAccDynamoDBTable_gsiWarmThroughput_billingPayPerRequest
--- PASS: TestAccDynamoDBTable_gsiWarmThroughput_billingPayPerRequest (599.77s)
=== CONT  TestAccDynamoDBTable_gsiWarmThroughput_billingProvisioned
--- PASS: TestAccDynamoDBTable_Replica_MRSC_doubleAddCMK (724.83s)
=== CONT  TestAccDynamoDBTable_Replica_MRSC_CreateEventuallyConsistent
--- PASS: TestAccDynamoDBTable_Replica_tagsUpdate (761.22s)
=== CONT  TestAccDynamoDBTable_tableClassExplicitDefault
--- PASS: TestAccDynamoDBTable_gsiWarmThroughput_switchBilling (745.37s)
=== CONT  TestAccDynamoDBTable_tableClassInfrequentAccess
--- PASS: TestAccDynamoDBTable_tableClassExplicitDefault (30.67s)
=== CONT  TestAccDynamoDBTable_Replica_deletionProtection
--- PASS: TestAccDynamoDBTable_tableClassInfrequentAccess (39.98s)
=== CONT  TestAccDynamoDBTable_Replica_upgradeV6_2_0
--- PASS: TestAccDynamoDBTable_gsiWarmThroughput_billingProvisioned (340.63s)
=== CONT  TestAccDynamoDBTable_Replica_MRSC_NotEnoughReplicas
--- PASS: TestAccDynamoDBTable_Replica_MRSC_NotEnoughReplicas (27.85s)
=== CONT  TestAccDynamoDBTable_Replica_MRSC_MixedConsistencyModes
--- PASS: TestAccDynamoDBTable_Replica_MRSC_MixedConsistencyModes (25.41s)
=== CONT  TestAccDynamoDBTable_BillingMode_provisionedToPayPerRequest
--- PASS: TestAccDynamoDBTable_Replica_MRSC_CreateEventuallyConsistent (412.24s)
=== CONT  TestAccDynamoDBTable_Replica_tags_nonPropagatedTagsAreUnmanaged
--- PASS: TestAccDynamoDBTable_Replica_upgradeV6_2_0 (314.09s)
=== CONT  TestAccDynamoDBTable_Replica_tags_notPropagatedToAddedReplica
--- PASS: TestAccDynamoDBTable_BillingMode_provisionedToPayPerRequest (329.13s)
=== CONT  TestAccDynamoDBTable_Replica_tags_propagateToAddedReplica
--- PASS: TestAccDynamoDBTable_Replica_tags_nonPropagatedTagsAreUnmanaged (480.52s)
=== CONT  TestAccDynamoDBTable_Replica_tags_updateIsPropagated_twoOfTwo
--- PASS: TestAccDynamoDBTable_Replica_tags_notPropagatedToAddedReplica (481.22s)
=== CONT  TestAccDynamoDBTable_Replica_tags_updateIsPropagated_oneOfTwo
--- PASS: TestAccDynamoDBTable_Replica_deletionProtection (1064.62s)
=== CONT  TestAccDynamoDBTable_Replica_pitrKMS
--- PASS: TestAccDynamoDBTable_Replica_tags_propagateToAddedReplica (553.63s)
=== CONT  TestAccDynamoDBTable_Replica_pitr
--- PASS: TestAccDynamoDBTable_Replica_tags_updateIsPropagated_twoOfTwo (490.53s)
=== CONT  TestAccDynamoDBTable_Replica_doubleAddCMK
--- PASS: TestAccDynamoDBTable_Replica_tags_updateIsPropagated_oneOfTwo (487.28s)
=== CONT  TestAccDynamoDBTable_Replica_singleCMK
--- PASS: TestAccDynamoDBTable_Replica_pitr (478.54s)
=== CONT  TestAccDynamoDBTable_Replica_singleDefaultKeyEncryptedAmazonOwned
--- PASS: TestAccDynamoDBTable_Replica_singleCMK (345.81s)
=== CONT  TestAccDynamoDBTable_Replica_singleDefaultKeyEncrypted
--- PASS: TestAccDynamoDBTable_Replica_pitrKMS (600.76s)
=== CONT  TestAccDynamoDBTable_Replica_singleStreamSpecification
--- PASS: TestAccDynamoDBTable_Replica_singleStreamSpecification (230.03s)
=== CONT  TestAccDynamoDBTable_Replica_single
--- PASS: TestAccDynamoDBTable_Replica_singleDefaultKeyEncryptedAmazonOwned (362.66s)
=== CONT  TestAccDynamoDBTable_Replica_multiple
--- PASS: TestAccDynamoDBTable_Replica_singleDefaultKeyEncrypted (361.24s)
=== CONT  TestAccDynamoDBTable_restoreCrossRegion
--- PASS: TestAccDynamoDBTable_Replica_single (606.25s)
=== CONT  TestAccDynamoDBTable_encryption
--- PASS: TestAccDynamoDBTable_encryption (116.19s)
=== CONT  TestAccDynamoDBTable_attributeUpdateValidation
--- PASS: TestAccDynamoDBTable_attributeUpdateValidation (3.51s)
=== CONT  TestAccDynamoDBTable_lsiUpdate
--- PASS: TestAccDynamoDBTable_lsiUpdate (57.08s)
=== CONT  TestAccDynamoDBTable_attributeUpdate
    table_test.go:2062: Step 1/5 error: After applying this test step, the non-refresh plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_dynamodb_table.test will be updated in-place
          ~ resource "aws_dynamodb_table" "test" {
                id                          = "tf-acc-test-2332131552376288101"
                name                        = "tf-acc-test-2332131552376288101"
                # (13 unchanged attributes hidden)
        
              - global_secondary_index {
                  - hash_key           = "firstKey" -> null
                  - name               = "gsiName" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "KEYS_ONLY" -> null
                  - read_capacity      = 10 -> null
                  - write_capacity     = 10 -> null
                    # (1 unchanged attribute hidden)
        
                  - warm_throughput {
                      - read_units_per_second  = 10 -> null
                      - write_units_per_second = 10 -> null
                    }
                }
              + global_secondary_index {
                  + hash_key           = "firstKey"
                  + name               = "gsiName"
                  + non_key_attributes = []
                  + projection_type    = "KEYS_ONLY"
                  + read_capacity      = 10
                  + write_capacity     = 10
                    # (1 unchanged attribute hidden)
        
                  + warm_throughput (known after apply)
                }
        
                # (5 unchanged blocks hidden)
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccDynamoDBTable_attributeUpdate (35.89s)
=== CONT  TestAccDynamoDBTable_TTL_validate
--- PASS: TestAccDynamoDBTable_TTL_validate (2.56s)
=== CONT  TestAccDynamoDBTable_TTL_updateDisable
--- PASS: TestAccDynamoDBTable_restoreCrossRegion (821.90s)
=== CONT  TestAccDynamoDBTable_TTL_updateEnable
--- PASS: TestAccDynamoDBTable_Replica_doubleAddCMK (1556.70s)
=== CONT  TestAccDynamoDBTable_TTL_disabled
--- PASS: TestAccDynamoDBTable_TTL_updateEnable (43.04s)
=== CONT  TestAccDynamoDBTable_TTL_enabled
--- PASS: TestAccDynamoDBTable_TTL_disabled (31.44s)
=== CONT  TestAccDynamoDBTable_GsiUpdateNonKeyAttributes_emptyPlan
--- PASS: TestAccDynamoDBTable_TTL_enabled (33.98s)
=== CONT  TestAccDynamoDBTable_gsiUpdateNonKeyAttributes
=== NAME  TestAccDynamoDBTable_GsiUpdateNonKeyAttributes_emptyPlan
    table_test.go:1748: Step 1/3 error: After applying this test step, the non-refresh plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_dynamodb_table.test will be updated in-place
          ~ resource "aws_dynamodb_table" "test" {
                id                          = "tf-acc-test-2266634513583622465"
                name                        = "tf-acc-test-2266634513583622465"
                # (13 unchanged attributes hidden)
        
              - global_secondary_index {
                  - hash_key           = "att1" -> null
                  - name               = "att1-index" -> null
                  - non_key_attributes = [
                      - "AnotherAttribute",
                      - "RandomAttribute",
                    ] -> null
                  - projection_type    = "INCLUDE" -> null
                  - range_key          = "att2" -> null
                  - read_capacity      = 1 -> null
                  - write_capacity     = 1 -> null
        
                  - warm_throughput {
                      - read_units_per_second  = 1 -> null
                      - write_units_per_second = 1 -> null
                    }
                }
              + global_secondary_index {
                  + hash_key           = "att1"
                  + name               = "att1-index"
                  + non_key_attributes = [
                      + "AnotherAttribute",
                      + "RandomAttribute",
                    ]
                  + projection_type    = "INCLUDE"
                  + range_key          = "att2"
                  + read_capacity      = 1
                  + write_capacity     = 1
        
                  + warm_throughput (known after apply)
                }
        
                # (6 unchanged blocks hidden)
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccDynamoDBTable_GsiUpdateNonKeyAttributes_emptyPlan (28.35s)
=== CONT  TestAccDynamoDBTable_lsiNonKeyAttributes
=== NAME  TestAccDynamoDBTable_gsiUpdateNonKeyAttributes
    table_test.go:1654: Step 1/3 error: After applying this test step, the non-refresh plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_dynamodb_table.test will be updated in-place
          ~ resource "aws_dynamodb_table" "test" {
                id                          = "tf-acc-test-1117018953797177757"
                name                        = "tf-acc-test-1117018953797177757"
                # (13 unchanged attributes hidden)
        
              - global_secondary_index {
                  - hash_key           = "att1" -> null
                  - name               = "att1-index" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "ALL" -> null
                  - read_capacity      = 1 -> null
                  - write_capacity     = 1 -> null
                    # (1 unchanged attribute hidden)
        
                  - warm_throughput {
                      - read_units_per_second  = 1 -> null
                      - write_units_per_second = 1 -> null
                    }
                }
              - global_secondary_index {
                  - hash_key           = "att3" -> null
                  - name               = "att3-index" -> null
                  - non_key_attributes = [
                      - "RandomAttribute",
                    ] -> null
                  - projection_type    = "INCLUDE" -> null
                  - range_key          = "att4" -> null
                  - read_capacity      = 1 -> null
                  - write_capacity     = 1 -> null
        
                  - warm_throughput {
                      - read_units_per_second  = 1 -> null
                      - write_units_per_second = 1 -> null
                    }
                }
              - global_secondary_index {
                  - hash_key           = "att4" -> null
                  - name               = "att2-index" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "ALL" -> null
                  - range_key          = "att2" -> null
                  - read_capacity      = 1 -> null
                  - write_capacity     = 1 -> null
        
                  - warm_throughput {
                      - read_units_per_second  = 1 -> null
                      - write_units_per_second = 1 -> null
                    }
                }
              + global_secondary_index {
                  + hash_key           = "att1"
                  + name               = "att1-index"
                  + non_key_attributes = []
                  + projection_type    = "ALL"
                  + read_capacity      = 1
                  + write_capacity     = 1
                    # (1 unchanged attribute hidden)
        
                  + warm_throughput (known after apply)
                }
              + global_secondary_index {
                  + hash_key           = "att3"
                  + name               = "att3-index"
                  + non_key_attributes = [
                      + "RandomAttribute",
                    ]
                  + projection_type    = "INCLUDE"
                  + range_key          = "att4"
                  + read_capacity      = 1
                  + write_capacity     = 1
        
                  + warm_throughput (known after apply)
                }
              + global_secondary_index {
                  + hash_key           = "att4"
                  + name               = "att2-index"
                  + non_key_attributes = []
                  + projection_type    = "ALL"
                  + range_key          = "att2"
                  + read_capacity      = 1
                  + write_capacity     = 1
        
                  + warm_throughput (known after apply)
                }
        
                # (8 unchanged blocks hidden)
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccDynamoDBTable_gsiUpdateNonKeyAttributes (40.26s)
=== CONT  TestAccDynamoDBTable_gsiUpdateOtherAttributes
--- PASS: TestAccDynamoDBTable_lsiNonKeyAttributes (33.27s)
=== CONT  TestAccDynamoDBTable_gsiUpdateCapacity
--- PASS: TestAccDynamoDBTable_Replica_multiple (957.81s)
=== CONT  TestAccDynamoDBTable_streamSpecificationValidation
--- PASS: TestAccDynamoDBTable_streamSpecificationValidation (1.27s)
=== CONT  TestAccDynamoDBTable_streamSpecificationDiffs
=== NAME  TestAccDynamoDBTable_gsiUpdateOtherAttributes
    table_test.go:1523: Step 1/3 error: After applying this test step, the non-refresh plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_dynamodb_table.test will be updated in-place
          ~ resource "aws_dynamodb_table" "test" {
                id                          = "tf-acc-test-8041857294378754095"
                name                        = "tf-acc-test-8041857294378754095"
                # (13 unchanged attributes hidden)
        
              - global_secondary_index {
                  - hash_key           = "att1" -> null
                  - name               = "att1-index" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "ALL" -> null
                  - read_capacity      = 1 -> null
                  - write_capacity     = 1 -> null
                    # (1 unchanged attribute hidden)
        
                  - warm_throughput {
                      - read_units_per_second  = 1 -> null
                      - write_units_per_second = 1 -> null
                    }
                }
              - global_secondary_index {
                  - hash_key           = "att2" -> null
                  - name               = "att2-index" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "ALL" -> null
                  - read_capacity      = 1 -> null
                  - write_capacity     = 1 -> null
                    # (1 unchanged attribute hidden)
        
                  - warm_throughput {
                      - read_units_per_second  = 1 -> null
                      - write_units_per_second = 1 -> null
                    }
                }
              - global_secondary_index {
                  - hash_key           = "att3" -> null
                  - name               = "att3-index" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "ALL" -> null
                  - read_capacity      = 1 -> null
                  - write_capacity     = 1 -> null
                    # (1 unchanged attribute hidden)
        
                  - warm_throughput {
                      - read_units_per_second  = 1 -> null
                      - write_units_per_second = 1 -> null
                    }
                }
              + global_secondary_index {
                  + hash_key           = "att1"
                  + name               = "att1-index"
                  + non_key_attributes = []
                  + projection_type    = "ALL"
                  + read_capacity      = 1
                  + write_capacity     = 1
                    # (1 unchanged attribute hidden)
        
                  + warm_throughput (known after apply)
                }
              + global_secondary_index {
                  + hash_key           = "att2"
                  + name               = "att2-index"
                  + non_key_attributes = []
                  + projection_type    = "ALL"
                  + read_capacity      = 1
                  + write_capacity     = 1
                    # (1 unchanged attribute hidden)
        
                  + warm_throughput (known after apply)
                }
              + global_secondary_index {
                  + hash_key           = "att3"
                  + name               = "att3-index"
                  + non_key_attributes = []
                  + projection_type    = "ALL"
                  + read_capacity      = 1
                  + write_capacity     = 1
                    # (1 unchanged attribute hidden)
        
                  + warm_throughput (known after apply)
                }
        
                # (7 unchanged blocks hidden)
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
=== NAME  TestAccDynamoDBTable_gsiUpdateCapacity
    table_test.go:1454: Step 1/3 error: After applying this test step, the non-refresh plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_dynamodb_table.test will be updated in-place
          ~ resource "aws_dynamodb_table" "test" {
                id                          = "tf-acc-test-77099436099650130"
                name                        = "tf-acc-test-77099436099650130"
                # (13 unchanged attributes hidden)
        
              - global_secondary_index {
                  - hash_key           = "att1" -> null
                  - name               = "att1-index" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "ALL" -> null
                  - read_capacity      = 1 -> null
                  - write_capacity     = 1 -> null
                    # (1 unchanged attribute hidden)
        
                  - warm_throughput {
                      - read_units_per_second  = 1 -> null
                      - write_units_per_second = 1 -> null
                    }
                }
              - global_secondary_index {
                  - hash_key           = "att2" -> null
                  - name               = "att2-index" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "ALL" -> null
                  - read_capacity      = 1 -> null
                  - write_capacity     = 1 -> null
                    # (1 unchanged attribute hidden)
        
                  - warm_throughput {
                      - read_units_per_second  = 1 -> null
                      - write_units_per_second = 1 -> null
                    }
                }
              - global_secondary_index {
                  - hash_key           = "att3" -> null
                  - name               = "att3-index" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "ALL" -> null
                  - read_capacity      = 1 -> null
                  - write_capacity     = 1 -> null
                    # (1 unchanged attribute hidden)
        
                  - warm_throughput {
                      - read_units_per_second  = 1 -> null
                      - write_units_per_second = 1 -> null
                    }
                }
              + global_secondary_index {
                  + hash_key           = "att1"
                  + name               = "att1-index"
                  + non_key_attributes = []
                  + projection_type    = "ALL"
                  + read_capacity      = 1
                  + write_capacity     = 1
                    # (1 unchanged attribute hidden)
        
                  + warm_throughput (known after apply)
                }
              + global_secondary_index {
                  + hash_key           = "att2"
                  + name               = "att2-index"
                  + non_key_attributes = []
                  + projection_type    = "ALL"
                  + read_capacity      = 1
                  + write_capacity     = 1
                    # (1 unchanged attribute hidden)
        
                  + warm_throughput (known after apply)
                }
              + global_secondary_index {
                  + hash_key           = "att3"
                  + name               = "att3-index"
                  + non_key_attributes = []
                  + projection_type    = "ALL"
                  + read_capacity      = 1
                  + write_capacity     = 1
                    # (1 unchanged attribute hidden)
        
                  + warm_throughput (known after apply)
                }
        
                # (7 unchanged blocks hidden)
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccDynamoDBTable_gsiUpdateOtherAttributes (40.84s)
=== CONT  TestAccDynamoDBTable_streamSpecification
--- FAIL: TestAccDynamoDBTable_gsiUpdateCapacity (40.62s)
=== CONT  TestAccDynamoDBTable_gsiOnDemandThroughput
    table_test.go:1266: Step 1/3 error: After applying this test step, the non-refresh plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_dynamodb_table.test will be updated in-place
          ~ resource "aws_dynamodb_table" "test" {
                id                          = "tf-acc-test-4460715309995466402"
                name                        = "tf-acc-test-4460715309995466402"
                # (13 unchanged attributes hidden)
        
              - global_secondary_index {
                  - hash_key           = "att1" -> null
                  - name               = "att1-index" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "ALL" -> null
                  - read_capacity      = 0 -> null
                  - write_capacity     = 0 -> null
                    # (1 unchanged attribute hidden)
        
                  - on_demand_throughput {
                      - max_read_request_units  = 5 -> null
                      - max_write_request_units = 5 -> null
                    }
        
                  - warm_throughput {
                      - read_units_per_second  = 12000 -> null
                      - write_units_per_second = 4000 -> null
                    }
                }
              + global_secondary_index {
                  + hash_key           = "att1"
                  + name               = "att1-index"
                  + non_key_attributes = []
                  + projection_type    = "ALL"
                  + read_capacity      = (known after apply)
                  + write_capacity     = (known after apply)
                    # (1 unchanged attribute hidden)
        
                  + on_demand_throughput {
                      + max_read_request_units  = 5
                      + max_write_request_units = 5
                    }
        
                  + warm_throughput (known after apply)
                }
        
                # (6 unchanged blocks hidden)
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccDynamoDBTable_gsiOnDemandThroughput (37.21s)
=== CONT  TestAccDynamoDBTable_onDemandThroughput
--- PASS: TestAccDynamoDBTable_streamSpecification (40.21s)
=== CONT  TestAccDynamoDBTable_BillingMode_payPerRequestBasic
--- PASS: TestAccDynamoDBTable_streamSpecificationDiffs (93.36s)
=== CONT  TestAccDynamoDBTable_BillingModeGSI_provisionedToPayPerRequest
--- PASS: TestAccDynamoDBTable_onDemandThroughput (54.79s)
=== CONT  TestAccDynamoDBTable_BillingModeGSI_payPerRequestToProvisioned
=== NAME  TestAccDynamoDBTable_BillingModeGSI_provisionedToPayPerRequest
    table_test.go:1127: Step 1/3 error: After applying this test step, the non-refresh plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_dynamodb_table.test will be updated in-place
          ~ resource "aws_dynamodb_table" "test" {
                id                          = "tf-acc-test-4466658980593099023"
                name                        = "tf-acc-test-4466658980593099023"
                # (13 unchanged attributes hidden)
        
              - global_secondary_index {
                  - hash_key           = "TestTableGSIKey" -> null
                  - name               = "TestTableGSI" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "KEYS_ONLY" -> null
                  - read_capacity      = 1 -> null
                  - write_capacity     = 1 -> null
                    # (1 unchanged attribute hidden)
        
                  - warm_throughput {
                      - read_units_per_second  = 1 -> null
                      - write_units_per_second = 1 -> null
                    }
                }
              + global_secondary_index {
                  + hash_key           = "TestTableGSIKey"
                  + name               = "TestTableGSI"
                  + non_key_attributes = []
                  + projection_type    = "KEYS_ONLY"
                  + read_capacity      = 1
                  + write_capacity     = 1
                    # (1 unchanged attribute hidden)
        
                  + warm_throughput (known after apply)
                }
        
                # (5 unchanged blocks hidden)
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccDynamoDBTable_BillingModeGSI_provisionedToPayPerRequest (37.62s)
=== CONT  TestAccDynamoDBTable_BillingMode_provisionedToPayPerRequestIgnoreChanges
=== NAME  TestAccDynamoDBTable_BillingModeGSI_payPerRequestToProvisioned
    table_test.go:1085: Step 1/3 error: After applying this test step, the non-refresh plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_dynamodb_table.test will be updated in-place
          ~ resource "aws_dynamodb_table" "test" {
                id                          = "tf-acc-test-5052767702651122118"
                name                        = "tf-acc-test-5052767702651122118"
                # (13 unchanged attributes hidden)
        
              - global_secondary_index {
                  - hash_key           = "TestTableGSIKey" -> null
                  - name               = "TestTableGSI" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "KEYS_ONLY" -> null
                  - read_capacity      = 0 -> null
                  - write_capacity     = 0 -> null
                    # (1 unchanged attribute hidden)
        
                  - warm_throughput {
                      - read_units_per_second  = 12000 -> null
                      - write_units_per_second = 4000 -> null
                    }
                }
              + global_secondary_index {
                  + hash_key           = "TestTableGSIKey"
                  + name               = "TestTableGSI"
                  + non_key_attributes = []
                  + projection_type    = "KEYS_ONLY"
                  + read_capacity      = (known after apply)
                  + write_capacity     = (known after apply)
                    # (1 unchanged attribute hidden)
        
                  + warm_throughput (known after apply)
                }
        
                # (5 unchanged blocks hidden)
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccDynamoDBTable_BillingModeGSI_payPerRequestToProvisioned (41.90s)
=== CONT  TestAccDynamoDBTable_backup_overrideEncryption
=== NAME  TestAccDynamoDBTable_BillingMode_payPerRequestBasic
    table_test.go:1166: Step 3/3 error: After applying this test step, the non-refresh plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_dynamodb_table.test will be updated in-place
          ~ resource "aws_dynamodb_table" "test" {
                id                          = "tf-acc-test-6712146163174758186"
                name                        = "tf-acc-test-6712146163174758186"
                tags                        = {}
                # (13 unchanged attributes hidden)
        
              - global_secondary_index {
                  - hash_key           = "TestTableGSIKey" -> null
                  - name               = "TestTableGSI" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "KEYS_ONLY" -> null
                  - read_capacity      = 0 -> null
                  - write_capacity     = 0 -> null
                    # (1 unchanged attribute hidden)
        
                  - warm_throughput {
                      - read_units_per_second  = 12000 -> null
                      - write_units_per_second = 4000 -> null
                    }
                }
              + global_secondary_index {
                  + hash_key           = "TestTableGSIKey"
                  + name               = "TestTableGSI"
                  + non_key_attributes = []
                  + projection_type    = "KEYS_ONLY"
                  + read_capacity      = (known after apply)
                  + write_capacity     = (known after apply)
                    # (1 unchanged attribute hidden)
        
                  + warm_throughput (known after apply)
                }
        
                # (5 unchanged blocks hidden)
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccDynamoDBTable_BillingMode_payPerRequestBasic (177.91s)
=== CONT  TestAccDynamoDBTable_importTable
--- PASS: TestAccDynamoDBTable_importTable (115.53s)
=== CONT  TestAccDynamoDBTable_backupEncryption
--- PASS: TestAccDynamoDBTable_BillingMode_provisionedToPayPerRequestIgnoreChanges (373.78s)
=== CONT  TestAccDynamoDBTable_tableClass_migrate
--- PASS: TestAccDynamoDBTable_tableClass_migrate (43.54s)
=== CONT  TestAccDynamoDBTable_Replica_MRSC_TooManyReplicas
--- PASS: TestAccDynamoDBTable_Replica_MRSC_TooManyReplicas (24.24s)
=== CONT  TestAccDynamoDBTable_tags_DefaultTags_updateToResourceOnly
--- PASS: TestAccDynamoDBTable_tags_DefaultTags_updateToResourceOnly (41.45s)
=== CONT  TestAccDynamoDBTable_BillingMode_payPerRequestToProvisionedIgnoreChanges
--- PASS: TestAccDynamoDBTable_BillingMode_payPerRequestToProvisionedIgnoreChanges (148.37s)
=== CONT  TestAccDynamoDBTable_BillingMode_payPerRequestToProvisioned
--- PASS: TestAccDynamoDBTable_backup_overrideEncryption (791.89s)
=== CONT  TestAccDynamoDBTable_enablePITRWithCustomRecoveryPeriod
    table_test.go:871: Step 1/4 error: After applying this test step, the non-refresh plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_dynamodb_table.test will be updated in-place
          ~ resource "aws_dynamodb_table" "test" {
                id                          = "tf-acc-test-373388234508115809"
                name                        = "tf-acc-test-373388234508115809"
                # (14 unchanged attributes hidden)
        
              - global_secondary_index {
                  - hash_key           = "TestTableHashKey" -> null
                  - name               = "InitialTestTableGSI" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "KEYS_ONLY" -> null
                  - range_key          = "TestGSIRangeKey" -> null
                  - read_capacity      = 1 -> null
                  - write_capacity     = 1 -> null
        
                  - warm_throughput {
                      - read_units_per_second  = 1 -> null
                      - write_units_per_second = 1 -> null
                    }
                }
              + global_secondary_index {
                  + hash_key           = "TestTableHashKey"
                  + name               = "InitialTestTableGSI"
                  + non_key_attributes = []
                  + projection_type    = "KEYS_ONLY"
                  + range_key          = "TestGSIRangeKey"
                  + read_capacity      = 1
                  + write_capacity     = 1
        
                  + warm_throughput (known after apply)
                }
        
                # (8 unchanged blocks hidden)
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccDynamoDBTable_enablePITRWithCustomRecoveryPeriod (36.92s)
=== CONT  TestAccDynamoDBTable_enablePITR
    table_test.go:834: Step 1/3 error: After applying this test step, the non-refresh plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_dynamodb_table.test will be updated in-place
          ~ resource "aws_dynamodb_table" "test" {
                id                          = "tf-acc-test-3750261629239152888"
                name                        = "tf-acc-test-3750261629239152888"
                # (14 unchanged attributes hidden)
        
              - global_secondary_index {
                  - hash_key           = "TestTableHashKey" -> null
                  - name               = "InitialTestTableGSI" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "KEYS_ONLY" -> null
                  - range_key          = "TestGSIRangeKey" -> null
                  - read_capacity      = 1 -> null
                  - write_capacity     = 1 -> null
        
                  - warm_throughput {
                      - read_units_per_second  = 1 -> null
                      - write_units_per_second = 1 -> null
                    }
                }
              + global_secondary_index {
                  + hash_key           = "TestTableHashKey"
                  + name               = "InitialTestTableGSI"
                  + non_key_attributes = []
                  + projection_type    = "KEYS_ONLY"
                  + range_key          = "TestGSIRangeKey"
                  + read_capacity      = 1
                  + write_capacity     = 1
        
                  + warm_throughput (known after apply)
                }
        
                # (8 unchanged blocks hidden)
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccDynamoDBTable_enablePITR (36.96s)
=== CONT  TestAccDynamoDBTable_extended
    table_test.go:759: Step 1/3 error: After applying this test step, the non-refresh plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_dynamodb_table.test will be updated in-place
          ~ resource "aws_dynamodb_table" "test" {
                id                          = "tf-acc-test-9134458295105045105"
                name                        = "tf-acc-test-9134458295105045105"
                # (14 unchanged attributes hidden)
        
              - global_secondary_index {
                  - hash_key           = "TestTableHashKey" -> null
                  - name               = "InitialTestTableGSI" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "KEYS_ONLY" -> null
                  - range_key          = "TestGSIRangeKey" -> null
                  - read_capacity      = 1 -> null
                  - write_capacity     = 1 -> null
        
                  - warm_throughput {
                      - read_units_per_second  = 1 -> null
                      - write_units_per_second = 1 -> null
                    }
                }
              + global_secondary_index {
                  + hash_key           = "TestTableHashKey"
                  + name               = "InitialTestTableGSI"
                  + non_key_attributes = []
                  + projection_type    = "KEYS_ONLY"
                  + range_key          = "TestGSIRangeKey"
                  + read_capacity      = 1
                  + write_capacity     = 1
        
                  + warm_throughput (known after apply)
                }
        
                # (8 unchanged blocks hidden)
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccDynamoDBTable_extended (37.14s)
=== CONT  TestAccDynamoDBTable_Disappears_payPerRequestWithGSI
--- PASS: TestAccDynamoDBTable_BillingMode_payPerRequestToProvisioned (309.41s)
=== CONT  TestAccDynamoDBTable_disappears
--- PASS: TestAccDynamoDBTable_disappears (21.57s)
=== CONT  TestAccDynamoDBTable_deletion_protection
=== NAME  TestAccDynamoDBTable_Disappears_payPerRequestWithGSI
    table_test.go:719: Step 2/3 error: After applying this test step, the non-refresh plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_dynamodb_table.test will be updated in-place
          ~ resource "aws_dynamodb_table" "test" {
                id                          = "tf-acc-test-4221255579485040319"
                name                        = "tf-acc-test-4221255579485040319"
                # (13 unchanged attributes hidden)
        
              - global_secondary_index {
                  - hash_key           = "TestTableGSIKey" -> null
                  - name               = "TestTableGSI" -> null
                  - non_key_attributes = [] -> null
                  - projection_type    = "KEYS_ONLY" -> null
                  - read_capacity      = 0 -> null
                  - write_capacity     = 0 -> null
                    # (1 unchanged attribute hidden)
        
                  - warm_throughput {
                      - read_units_per_second  = 12000 -> null
                      - write_units_per_second = 4000 -> null
                    }
                }
              + global_secondary_index {
                  + hash_key           = "TestTableGSIKey"
                  + name               = "TestTableGSI"
                  + non_key_attributes = []
                  + projection_type    = "KEYS_ONLY"
                  + read_capacity      = (known after apply)
                  + write_capacity     = (known after apply)
                    # (1 unchanged attribute hidden)
        
                  + warm_throughput (known after apply)
                }
        
                # (5 unchanged blocks hidden)
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- PASS: TestAccDynamoDBTable_deletion_protection (42.12s)
=== CONT  TestAccDynamoDBTable_basic
--- FAIL: TestAccDynamoDBTable_Disappears_payPerRequestWithGSI (78.39s)
=== CONT  TestAccDynamoDBTable_tags_IgnoreTags_Overlap_ResourceTag
--- PASS: TestAccDynamoDBTable_backupEncryption (784.61s)
=== CONT  TestAccDynamoDBTable_tags_IgnoreTags_Overlap_DefaultTag
--- PASS: TestAccDynamoDBTable_basic (24.70s)
=== CONT  TestAccDynamoDBTable_tags_ComputedTag_OnUpdate_Replace
--- PASS: TestAccDynamoDBTable_tags_IgnoreTags_Overlap_ResourceTag (49.92s)
=== CONT  TestAccDynamoDBTable_tags_ComputedTag_OnUpdate_Add
--- PASS: TestAccDynamoDBTable_tags_IgnoreTags_Overlap_DefaultTag (55.08s)
=== CONT  TestAccDynamoDBTable_tags_ComputedTag_OnCreate
--- PASS: TestAccDynamoDBTable_tags_ComputedTag_OnUpdate_Replace (47.88s)
=== CONT  TestAccDynamoDBTable_tags_DefaultTags_nullNonOverlappingResourceTag
--- PASS: TestAccDynamoDBTable_tags_ComputedTag_OnCreate (30.93s)
=== CONT  TestAccDynamoDBTable_tags_DefaultTags_nullOverlappingResourceTag
--- PASS: TestAccDynamoDBTable_tags_DefaultTags_nullNonOverlappingResourceTag (27.50s)
=== CONT  TestAccDynamoDBTable_tags_DefaultTags_emptyProviderOnlyTag
--- PASS: TestAccDynamoDBTable_tags_ComputedTag_OnUpdate_Add (47.90s)
=== CONT  TestAccDynamoDBTable_tags_DefaultTags_emptyResourceTag
--- PASS: TestAccDynamoDBTable_tags_DefaultTags_nullOverlappingResourceTag (25.51s)
=== CONT  TestAccDynamoDBTable_tags_null
--- PASS: TestAccDynamoDBTable_tags_DefaultTags_emptyProviderOnlyTag (27.02s)
=== CONT  TestAccDynamoDBTable_tags_DefaultTags_updateToProviderOnly
--- PASS: TestAccDynamoDBTable_tags_DefaultTags_emptyResourceTag (26.39s)
=== CONT  TestAccDynamoDBTable_tags_DefaultTags_overlapping
--- PASS: TestAccDynamoDBTable_tags_null (34.18s)
=== CONT  TestAccDynamoDBTable_tags_DefaultTags_nonOverlapping
--- PASS: TestAccDynamoDBTable_tags_DefaultTags_updateToProviderOnly (34.81s)
=== CONT  TestAccDynamoDBTable_tags_DefaultTags_providerOnly
--- PASS: TestAccDynamoDBTable_tags_DefaultTags_overlapping (68.71s)
=== CONT  TestAccDynamoDBTable_tags_EmptyTag_OnUpdate_Replace
--- PASS: TestAccDynamoDBTable_tags_DefaultTags_nonOverlapping (58.16s)
=== CONT  TestAccDynamoDBTable_tags_EmptyTag_OnUpdate_Add
--- PASS: TestAccDynamoDBTable_tags_EmptyTag_OnUpdate_Replace (41.50s)
=== CONT  TestAccDynamoDBTable_tags_EmptyTag_OnCreate
--- PASS: TestAccDynamoDBTable_tags_DefaultTags_providerOnly (79.46s)
=== CONT  TestAccDynamoDBTable_tags_AddOnUpdate
--- PASS: TestAccDynamoDBTable_tags_EmptyTag_OnUpdate_Add (61.67s)
=== CONT  TestAccDynamoDBTable_tags_EmptyMap
--- PASS: TestAccDynamoDBTable_tags_EmptyTag_OnCreate (44.17s)
=== CONT  TestAccDynamoDBTable_Replica_MRSC_pitrKMS
--- PASS: TestAccDynamoDBTable_tags_AddOnUpdate (41.34s)
=== CONT  TestAccDynamoDBTableDataSource_tags_IgnoreTags_Overlap_ResourceTag
--- PASS: TestAccDynamoDBTable_tags_EmptyMap (35.28s)
=== CONT  TestAccDynamoDBTable_tags
--- PASS: TestAccDynamoDBTableDataSource_tags_IgnoreTags_Overlap_ResourceTag (23.93s)
=== CONT  TestAccDynamoDBTableDataSource_pointInTimeRecovery
--- PASS: TestAccDynamoDBTableDataSource_pointInTimeRecovery (23.32s)
=== CONT  TestAccDynamoDBTableDataSource_onDemandThroughput
    table_data_source_test.go:65: Step 1/1 error: After applying this test step, the non-refresh plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
         <= read (data resources)
        
        Terraform will perform the following actions:
        
          # data.aws_dynamodb_table.test will be read during apply
          # (depends on a resource or a module with changes pending)
         <= data "aws_dynamodb_table" "test" {
              + arn                         = (known after apply)
              + attribute                   = (known after apply)
              + billing_mode                = (known after apply)
              + deletion_protection_enabled = (known after apply)
              + global_secondary_index      = (known after apply)
              + hash_key                    = (known after apply)
              + id                          = (known after apply)
              + local_secondary_index       = (known after apply)
              + name                        = "tf-acc-test-827348045030903900"
              + on_demand_throughput        = (known after apply)
              + point_in_time_recovery      = (known after apply)
              + range_key                   = (known after apply)
              + read_capacity               = (known after apply)
              + region                      = (known after apply)
              + replica                     = (known after apply)
              + stream_arn                  = (known after apply)
              + stream_enabled              = (known after apply)
              + stream_label                = (known after apply)
              + stream_view_type            = (known after apply)
              + table_class                 = (known after apply)
              + tags                        = (known after apply)
              + ttl                         = (known after apply)
              + warm_throughput             = (known after apply)
              + write_capacity              = (known after apply)
            }
        
          # aws_dynamodb_table.test will be updated in-place
          ~ resource "aws_dynamodb_table" "test" {
                id                          = "tf-acc-test-827348045030903900"
                name                        = "tf-acc-test-827348045030903900"
                tags                        = {
                    "Environment" = "test"
                    "Name"        = "dynamodb-table-1"
                }
                # (14 unchanged attributes hidden)
        
              - global_secondary_index {
                  - hash_key           = "GameTitle" -> null
                  - name               = "GameTitleIndex" -> null
                  - non_key_attributes = [
                      - "UserId",
                    ] -> null
                  - projection_type    = "INCLUDE" -> null
                  - range_key          = "TopScore" -> null
                  - read_capacity      = 0 -> null
                  - write_capacity     = 0 -> null
        
                  - on_demand_throughput {
                      - max_read_request_units  = 10 -> null
                      - max_write_request_units = 10 -> null
                    }
        
                  - warm_throughput {
                      - read_units_per_second  = 12000 -> null
                      - write_units_per_second = 4000 -> null
                    }
                }
              + global_secondary_index {
                  + hash_key           = "GameTitle"
                  + name               = "GameTitleIndex"
                  + non_key_attributes = [
                      + "UserId",
                    ]
                  + projection_type    = "INCLUDE"
                  + range_key          = "TopScore"
                  + read_capacity      = (known after apply)
                  + write_capacity     = (known after apply)
        
                  + on_demand_throughput {
                      + max_read_request_units  = 10
                      + max_write_request_units = 10
                    }
        
                  + warm_throughput (known after apply)
                }
        
                # (7 unchanged blocks hidden)
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccDynamoDBTableDataSource_onDemandThroughput (37.25s)
=== CONT  TestAccDynamoDBTableDataSource_basic
--- PASS: TestAccDynamoDBTable_tags (79.99s)
=== CONT  TestAccDynamoDBTableDataSource_tags_DefaultTags_nonOverlapping
--- PASS: TestAccDynamoDBTableDataSource_basic (39.33s)
=== CONT  TestAccDynamoDBTableDataSource_tags_IgnoreTags_Overlap_DefaultTag
--- PASS: TestAccDynamoDBTableDataSource_tags_DefaultTags_nonOverlapping (21.57s)
=== CONT  TestAccDynamoDBTableDataSource_tags_EmptyMap
--- PASS: TestAccDynamoDBTableDataSource_tags_IgnoreTags_Overlap_DefaultTag (23.52s)
=== CONT  TestAccDynamoDBTableDataSource_tags_NullMap
--- PASS: TestAccDynamoDBTableDataSource_tags_EmptyMap (29.15s)
--- PASS: TestAccDynamoDBTableDataSource_tags_NullMap (22.69s)
--- PASS: TestAccDynamoDBTable_Replica_MRSC_pitrKMS (297.36s)
--- PASS: TestAccDynamoDBTable_TTL_updateDisable (3653.18s)
FAIL
FAIL	github.com/hashicorp/terraform-provider-aws/internal/service/dynamodb	9525.155s
FAIL
make: *** [testacc] Error 1
```